{"class_name": "Sequential", "keras_version": "2.0.9", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "batch_input_shape": [null, 128, 128, 1], "activation": "linear", "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "dtype": "float32", "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "name": "conv2d_1", "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "name": "conv2d_2", "data_format": "channels_last", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.5}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "name": "conv2d_3", "data_format": "channels_last", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "linear", "units": 64, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "linear", "units": 16, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "name": "dense_2", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "softmax", "trainable": true}}]}