{"config": [{"config": {"use_bias": true, "dilation_rate": [1, 1], "trainable": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_1", "batch_input_shape": [null, 128, 128, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "strides": [1, 1], "bias_regularizer": null, "filters": 32, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"use_bias": true, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_2", "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"use_bias": true, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_3", "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "units": 64, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_3", "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"use_bias": true, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "units": 5, "name": "dense_2", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_5", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.0.9", "class_name": "Sequential"}